tim4431/Respeaker_walkie_talkie/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# XIAO ESP32-S3: 8 MB flash, 8 MB octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Opus encode needs the fast path
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1 ms tick for responsive pacing/debounce
CONFIG_FREERTOS_HZ=1000

# TCP audio transport: reconnect churn must not exhaust PCBs. Default
# MSL 60 s parks every closed connection in TIME_WAIT for 2 min.
CONFIG_LWIP_TCP_MSL=6000
CONFIG_LWIP_MAX_ACTIVE_TCP=16
CONFIG_LWIP_MAX_LISTENING_TCP=8
